app/controllers/links_controller.rb

  def relay
    link = Link.find_by(short_url: params[:short_url])
---
SELECT  "links".* FROM "links" WHERE "links"."short_url" = ? LIMIT ?  [["short_url", "9edc0d"], ["LIMIT", 1]]

  def index
    links = Link.all.map { |l| l.slice('short_url', 'long_url') }
---
SELECT "links".* FROM "links"

  def create
    link = Link.create!(long_url: params[:url])
---
INSERT INTO "links" ("id", "uid", "long_url", "short_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id", 1], ["uid", ""], ["long_url", "http://google.com"], ["short_url", "364ce8"], ["created_at", "2018-05-21 07:22:30.167364"], ["updated_at", "2018-05-21 07:22:30.167364"]]

  def show
    link = Link.find_by(short_url: params[:url]).try { |l| l.slice('short_url', 'long_url') } || []
---
SELECT  "links".* FROM "links" WHERE "links"."short_url" = ? LIMIT ?  [["short_url", "e83d60"], ["LIMIT", 1]]

  def destroy
    Link.find_by(short_url: params[:url]).delete
---
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 1]]
SELECT  "links".* FROM "links" WHERE "links"."short_url" = ? LIMIT ?  [["short_url", "blah"], ["LIMIT", 1]]